global LOAD;
if exist('LOAD')==1;
LOAD = load('mgua_meta.dat');
end;
N=LOAD(:,1)';
j=LOAD(:,2)';
p=LOAD(:,3)';
s=LOAD(:,4)';
jp = inline('(1.9098619681408686).*X1+(-0.31859733633573367).*X2+(1.9139554563064434).*X1.*X2','X1','X2');
js = inline('(3.5373678498401215).*X1+(-0.43642981864569313).*X2+(1.2677326349225129).*X1.*X2','X1','X2');
L21 = inline('(0.58155384503300134).*X1+(0.22613107528494575).*X2+(0.010475158946062877).*X1.*X2','X1','X2');
Y = L21(jp(j,p),js(j,s)); 
plot(1:size(LOAD(:,5)), LOAD(:,5)', 'k:', 1:size(LOAD(:,5)), Y', 'b-')
legend('Исходные данные', 'Рассчитанные данные');